# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
# brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
# brew 'gnupg2' # GNU privacy guard.
brew 'grep'
brew 'httpie'
# brew 'hub' # Git command line helper.
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'php'
brew 'phpunit'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'android-file-transfer'
cask 'android-studio'
cask 'balsamiq-mockups'
cask 'bartender'
# cask 'caffeine'
# cask 'coda'
cask 'db-browser-for-sqlite'
# cask 'docker'
cask 'expressvpn'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'handbrake'
cask 'insomnia'
cask 'iterm2'
cask 'java'
# cask 'mysqlworkbench'
cask 'ngrok'
cask 'phpstorm'
cask 'postman'
cask 'pycharm'
cask 'sequel-pro-nightly'
cask 'sublime-text'
# cask 'tableplus'
cask 'the-unarchiver'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-fira-code'

# Mac App Store
mas 'Bandwidth+', id: 490461369
mas 'Clocker', id: 1056643111
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Word', id: 462054704
mas 'WeChat', id: 836500024
mas 'Wunderlist', id: 410628904
