# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'awscli'
#brew 'bash' # Latest Bash version
brew 'cash-cli' # currency rates
brew 'cmus' # terminal player
brew 'coreutils' # Those that come with macOS are outdated
brew 'dfu-programmer' # Flashing Arduino bootloaders
brew 'xclip'
brew 'dos2unix'
brew 'entr'
brew 'findutils'
brew 'gawk'
#brew 'git' #EXTRACT
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'grep'
#brew 'htop' #EXTRACT
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
#brew 'netcat' #EXTRACT
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'reattach-to-user-namespace' # Required for tmux copy paste
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
#brew 'wget' #EXTRACT
brew 'zlib' # Needed for Memcached

# Development
# brew 'php@7.2'
# brew 'php@7.3'
#brew 'composer' # EXTRACT
#brew 'chafa' #EXTRACT
#brew 'ctags' # EXTRACT
brew 'gifsicle'
#brew 'imagemagick' # EXTRACT
brew 'jpegoptim'
#brew 'jq' # EXTRACT
brew 'mkcert'
#brew 'mysql' # EXTRACT
#brew 'nginx' # EXTRACT
#brew 'nmap' # EXTRACT
#brew 'node' # EXTRACT
brew 'optipng'
#brew 'php' # EXTRACT
brew 'phpunit'
brew 'pngquant'
brew 'proxychains-ng'
# brew 'redis' #EXTRACT
brew 'stockfish'
brew 'svgo'
#brew 'tmux' # EXTRACT
#brew 'watch' # EXTRACT
#brew 'yarn' # EXTRACT
#brew 'zsh' # EXTRACT


# Apps
cask 'alfred'
cask 'android-file-transfer'
cask 'android-studio'
cask 'arduino'
cask 'balsamiq-wireframes'
cask 'bartender'
cask 'burp-suite'
cask 'coda'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'handbrake'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'kicad'
cask 'lilypond'
cask 'midi-monitor'
cask 'moom'
cask 'obsidian'
cask 'ngrok'
cask 'postman'
cask 'pycharm'
cask 'reaper'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
mas 'Bandwidth+', id: 490461369
mas 'Clocker', id: 1056643111
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Word', id: 462054704
mas 'WeChat', id: 836500024
mas 'Wunderlist', id: 410628904
mas 'Trello', id: 1278508951
